In [2]:
!dir /w

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 70FE-DA3D

 C:\Develops 디렉터리

[.]                  [..]                 [.ipynb_checkpoints]
[files]              test_first.ipynb     [webscraping]
               1개 파일               5,330 바이트
               5개 디렉터리  33,038,581,760 바이트 남음

In [6]:
!pwd

/c/Develops

In [43]:
import pandas as pd

In [40]:
sample1 = pd.read_excel('./files/sample_1.xls', skipfooter = 2, header=1  , usecols='A:C' )
sample1

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [41]:
sample1.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [42]:
sample1[['입국객수']]

     입국객수
0  106320
1  191436
2     319
3      42
4  158912
5  232943

In [46]:
sample1[['입국객수','성별','국적코드']]

     입국객수  성별 국적코드
0  106320  남성  A01
1  191436  여성  A01
2     319  남성  A31
3      42  여성  A31
4  158912  남성  A18
5  232943  여성  A18

In [47]:
sample1[['기준년월']] = '2019-11'
sample1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [51]:
sample1['성별'] == '남성'

0     True
1    False
2     True
3    False
4     True
5    False
Name: 성별, dtype: bool

In [50]:
sample1[(sample1['성별'] == '남성')]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [63]:
sample1[(sample1['입국객수'] > 150000) & (sample1['성별'] ==\
                                      '남성')]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2019-11

In [57]:
sample1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [61]:
sample1['국적코드'].isin(['A01', 'A18'])

0     True
1     True
2    False
3    False
4     True
5     True
Name: 국적코드, dtype: bool

  # 엑셀 로드 
  # 국적코드가 A31, A18 인것 & 여성인것

In [64]:
sample2 = pd.read_excel('./files/sample_1.xls',\
skipfooter = 2, header=1  , usecols='A:C' )
sample2

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943